ArtShare/app/controllers/artworks_controller.rb

  def index
    artworks = Artwork.joins(:shared_viewers).find_by(artist_id: params[:user_id]).find_by()
---
SELECT  "artworks".* FROM "artworks" INNER JOIN "artwork_shares" ON "artwork_shares"."artwork_id" = "artworks"."id" INNER JOIN "users" ON "users"."id" = "artwork_shares"."viewer_id" WHERE "artworks"."artist_id" = $1 LIMIT $2  [["artist_id", 2], ["LIMIT", 1]]