ArtShare/app/controllers/users_controller.rb

  def destroy
    user = User.find_by(id: params[:id])

    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]